#+title:      A Klasse 2019-23
#+date:       [2022-12-28 Mi 20:52]
#+filetags:   :4a:Project:
#+identifier: 20221228T205258
#+CATEGORY: golling

* 4a 08:40-09:30
<%%(org-class 2022 9 12 2023 7 3 1 12)>
 
Thema "back to the Basics":

Apostel Paulus (Briefe)

Römer / 1. Korintherbrief

Bibel Stories:
[[file:~/Downloads/Bibel-Stories.pdf]]

Kahoot - Kurt Mikula:
[[https://www.mikula-kurt.net/spiele/kahoot-religion/]]

* 4a 09:35-10:25
<%%(org-class 2022 9 16 2023 7 7 5 12)>

... Apostel Paulus ...

* Reflexionen
 
** Null Bock mehr!
PERIOD: [2023-04-24 Mo 08:40]

Ich mag nimmer - ich werde umsatteln - werde nimmer Lehrer sein. Hat null Zweck. Suche ein Gespräch mit meinen Verantwortlichen. Den Schülern interessiert es einen Dreck; was oll ich mich abrackern und fertig machen für nix? Sicher nicht!

Mir wird wohl nix anderes übrig bleiben, als die Klasse noch bis zum Ende des Schuljahres zu ertragen. Da ist Hopfen und Malz verloren, nix mehr zu amchen. Außer: ich gehe einen harten Kurs und knalle ihnen regelmäßig eine LZK hin.

* 4A [KV Barbara Essl]

#+Name: 2021-students
| First         | Last        | Name                      | Note | Mitarbeit | Heft | LZK |
|---------------+-------------+---------------------------+------+-----------+------+-----|
| Johannes      | Aschner     | [[JohannesAschner][Johannes Aschner]]          |    1 |           |      |     |
| Denise        | Gaulke      | [[DeniseGaulke][Denise Gaulke]]             |    1 |           |      |     |
| Zita          | Hofer       | [[ZitaHofer][Zita Hofer]]                |    1 |           |      |     |
| Michael       | Höllweger   | [[MichaelHöllweger][Michael Höllweger]]         |    1 |           |      |     |
| Anna          | Hornegger   | [[AnnaHornegger][Anna Hornegger]]            |    1 |           |      |     |
| Emily         | Loidfellner | [[EmilyLoidfellner][Emily Loidfellner]]         |    1 |           |      |     |
| Michelle      | Neureiter   | [[MichelleNeureiter][Michelle Neureiter]]        |    1 |           |      |     |
| Selina        | Neureiter   | [[SelinaNeureiter][Selina Neureiter]]          |    1 |           |      |     |
| Florian       | Pointner    | [[FlorianPointner][Florian Pointner]]          |    1 |           |      |     |
| Theresa       | Reiter      | [[TheresaReiter][Theresa Reiter]]            |    1 |           |      |     |
| Lukas         | Russegger   | [[LukasRussegger][Lukas Russegger]]           |    1 |           |      |     |
| Lorena        | Schefbänker | [[LorenaSchefbänker][Lorena Schefbänker]]        |    1 |           |      |     |
| Maximilian    | Schönauer   | [[MaximilianSchönauer][Maximilian Schönauer]]      |    1 |           |      |     |
| Lara          | Schreder    | [[LaraSchreder][Lara Schreder]]             |    1 |           |      |     |
| David-Philipp | Strubreiter | [[David-PhilippStrubreiter][David-Philipp Strubreiter]] |    1 |           |      |     |
| Johanna       | Strubreiter | [[JohannaStrubreiter][Johanna Strubreiter]]       |    1 |           |      |     |
| Melanie       | Tikvic      | [[MelanieTikvic][Melanie Tikvic]]            |    1 |           |      |     |
|---------------+-------------+---------------------------+------+-----------+------+-----|
#+TBLFM: $4=vmean($5..$>)
#+TBLFM: $3='(concat "[[" $1 $2 "][" $1 " " $2 "]]")
#+TBLFM: $4='(identity remote(2021-22-Mitarbeit,@@#$4))

#+BEGIN_SRC python :var table=2021-students :results output raw
print('* Mitarbeit')
for student in table:
    first = student[0]
    last = student[1]
    email = first + '.' + last + '@golling.schule'
    print('** ' + first + last + '\n\n')
#+END_SRC

#+RESULTS:
* Mitarbeit
** JohannesAschner


** DeniseGaulke


** ZitaHofer


** MichaelHöllweger


** AnnaHornegger


** EmilyLoidfellner


** MichelleNeureiter


** SelinaNeureiter


** FlorianPointner


** TheresaReiter


** LukasRussegger


** LorenaSchefbänker


** MaximilianSchönauer


** LaraSchreder


** David-PhilippStrubreiter


** JohannaStrubreiter


** MelanieTikvic


